In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [5]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

There's three main useful methods concerned with finding unique values in a data frame.

In [6]:
df['col2'].unique() #find all unique values in column 2.return in numpy array.

array([444, 555, 666])

In [7]:
len(df['col2'].unique())

3

In [8]:
df['col2'].nunique() # both are same return the no.of unique values

3

In [9]:
df['col2'].value_counts() #return the count of all unique values in given column

col2
444    2
555    1
666    1
Name: count, dtype: int64

# selecting data

In [10]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
df['col1']>2 #return boolean of series.

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [13]:
df[(df['col1']>2)&(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

# applying function

In [16]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [20]:
def times2(x):
    return x*2

In [21]:
df['col1'].apply(times2) #apply custom funtion

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [22]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

apply funtion become mose powerful when its combine with lambda expression.

In [23]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [26]:
df.drop('col2',axis=1) # remove column or row based on our need.

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

To get column name and index name.

In [28]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [30]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [33]:
df.sort_values(by='col2') #sort by column name , index is sticks with data

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [39]:
df.isnull()#return by boolean values. null->true, notnull->false

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# pivot table

In [40]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [42]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN